# GetPipeFittingAndAccessoryData Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryPressureDropData..::..GetPipeFittingAndAccessoryData Method
PipeFittingAndAccessoryPressureDropData Class See Also
---
Returns the fitting and accessory information
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public PipeFittingAndAccessoryData GetPipeFittingAndAccessoryData()
```

Visual Basic
---
```text
Public Function GetPipeFittingAndAccessoryData As PipeFittingAndAccessoryData
```

Visual C++
---
```text
public:
PipeFittingAndAccessoryData^ GetPipeFittingAndAccessoryData()
```

# See Also
PipeFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace